Examinator/src/Catalogs/ЭлементыПодборкиСУЗ/ЭлементыПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ПодборкиСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.КлассификаторОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Якорь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ЭлементыПодборкиСУЗ/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Если ВесВопроса < 0 Тогда
		ВесВопроса = 0;
	КонецЕсли;
	
	Если ВесВопроса > 100 Тогда
		ВесВопроса = 100;
	КонецЕсли;	
	
	Если НЕ РазрешитьРедактироватьНаименование И ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) Тогда
		Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъектСУЗ, "Наименование");
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
